Revit 2027 API
BuiltInFailures.RebarFailures.RebarShapeFailureDueToStaggerOffset Property
 Can't solve Rebar Shape using the existing stagger offsets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarShapeFailureDueToStaggerOffset { get; }
Public Shared ReadOnly Property RebarShapeFailureDueToStaggerOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarShapeFailureDueToStaggerOffset {
	FailureDefinitionId^ get ();
}
static member RebarShapeFailureDueToStaggerOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace